## Pandas

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

#### Agenda

- What is Data Frames ?
  It is a combination of both rows and columns and it will basically show you a     representation format where in how yor data exactly looks like in the excel sheet in the same way it will be loaded
- What is Data Series ?
- Different operation in Pandas

In [2]:
## First step is to import pandas

import pandas as pd
import numpy as np

In [3]:
## Playing with Dataframe

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])

In [4]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.to_csv('Test1.csv')

In [6]:
## Accessing the elements
## 1. .loc(mainly focus on row indices) 2. .iloc(focusing on both row and column indices)

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [8]:
type(df.loc['Row1'])

## series can either be one row or one column

pandas.core.series.Series

In [10]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [20]:
df.iloc[0:2,:1]

      Column1
Row1        0
Row2        4

In [17]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [16]:
## Take the elements from the column2
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [23]:
## convert Dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [24]:
df.iloc[:,1:].values.shape

(5, 3)

In [26]:
## check null condition

df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [27]:
df['Column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Column1, dtype: int64

In [28]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [29]:
df[['Column3','Column4']]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19